
[
  {
    "category": "Centre for Career Readiness (CCR)",
    "content": "Our Career Coaches will help you:\n\n- Identify your strengths and interests\n- Build and enhance your resume or cover letter\n- Practise and master your interview skills"
  },
  {
    "category": "Centre for Career Readiness (CCR)",
    "content": "Name: Audrey Benedict\nProfile: View Audrey's Profile\nEmail: Audrey.Benedict@SingaporeTech.edu.sg\nPhone: 6592 1055\nRole: Career Coach\nFields: Hospitality Business, Food Business Management (Culinary Arts), Food Business Management (Baking and Pastry Arts), Digital Communications and Integrated Media\n\nBio: When she was little, Audrey wanted to be a musician – either a rock star or classical pianist. Unfortunately, her ability did not match her interest, so she decided to be content by simply listening to music instead. She also enjoys live theater, ballet, and musicals, and can't wait to travel to Broadway once again. Audrey is particularly partial to tea over coffee but will never turn down pretty Starbucks merchandise. She will also take a medium-rare steak over salad anytime!\n\nA bibliophile who still can't decide if she prefers hard copies or her Kindles, she is torn between the smell of a new book and saving shelf space with e-books. Some help, please? As you might have guessed, Audrey is also a fan of Word Games and is currently enjoying Wordle."
  },
  {
    "category": "Centre for Career Readiness (CCR)",
    "content": "Name: Rachel Wan\nProfile: View Rachel's Profile\nEmail: Rachel.Wan@SingaporeTech.edu.sg\nPhone: 6592 3610\nRole: Career Coach\nFields: Accountancy, Air Transport Management\n\nBio: Whether it’s nature walks, window shopping or just scouring the neighbourhood discovering new food hunts, your chances of bumping into Rachel is rather high as she dislikes idling at home! That being said, she enjoys occasional quiet moments journaling and drawing inspirations from musings on life and the experiences of people whom she has met.\n\nRachel has an unexplained fear of birds, cats, and lizards that she would rather jump off a plane than be trapped in a confined space with these critters. Ask her about it!"
  },
  {
    "category": "Centre for Career Readiness (CCR)",
    "content": "Name: Daniel Tay\nProfile: View Daniel's Profile\nEmail: TseHock.Tay@SingaporeTech.edu.sg\nPhone: 6592 1056\nRole: Career Coach\nFields: Mechatronics Systems\n\nBio: The idea of chilling on a beanbag in an air-con room, with a copy of MAD magazine and a glass of freezing coke makes Daniel a happy man. Nicknamed “Mooncake” by friends for his rounded face, he exudes positivity and shares advice with all, including his three daughters. To decompress, he listens to sentimental music, watches movies, reads humor books, and enjoys walks in parks."
  },
  {
    "category": "Centre for Career Readiness (CCR)",
    "content": "Name: Debbie Khoo\nProfile: View Debbie's Profile\nEmail: Debbie.Khoo@SingaporeTech.edu.sg\nPhone: 6592 8260\nRole: Career Coach\nFields: Aerospace Engineering, Aircraft Systems Engineering, Digital Supply Chain\n\nBio: Debbie has many awe-inspiring adventures, like surviving a capsized safety boat in a thunderstorm and walking 100km in 48 hours for charity. A fan of the paranormal, she has explored ghost tours and spooky places. Her travel bucket list includes Peru, Nepal, South Africa, and seeing the Northern Lights."
  },
  {
    "category": "Centre for Career Readiness (CCR)",
    "content": "Name: Eric Cheng\nProfile: View Eric's Profile\nEmail: Eric.Cheng@SingaporeTech.edu.sg\nPhone: 6592 2716\nRole: Career Coach\nFields: Civil Engineering, Sustainable Built Environment\n\nBio: Eric’s life mantra is about simplicity and helping others achieve significance. He values growth in every season and finds joy in nature, inspired by his time in Germany. A lover of music, Eric is also a self-taught violinist, clarinettist, bassist, and drummer."
  },
  {
    "category": "Centre for Career Readiness (CCR)",
    "content": "Name: Kong Kum Yew\nProfile: View Kum Yew's Profile\nEmail: KumYew.Kong@singaporetech.edu.sg\nPhone: 6592 8965\nRole: Career Coach\nFields: Mechanical Engineering\n\nBio: Kum Yew is passionate about sustainability, cutting down on plastics and advocating for a greener planet. He enjoys exploring different cultures and landscapes, playing tennis, and sharing his 20 years of industry experience to guide students in their career journeys."
  },
  {
    "category": "Centre for Career Readiness (CCR)",
    "content": "Name: Lim Kim Peng\nProfile: View Kim Peng's Profile\nEmail: KimPeng.Lim@SingaporeTech.edu.sg\nPhone: 6592 1516\nRole: Career Coach\nFields: Robotics Systems, Mechanical Design and Manufacturing Engineering\n\nBio: Kim Peng is on a quest to redeem business class air tickets. In his downtime, he explores neighborhoods in Singapore, enjoys long bus journeys with music on Spotify, and dreams of seeing snow."
  },
  {
    "category": "Centre for Career Readiness (CCR)",
    "content": "Name: Low Boon Huat\nProfile: View Boon Huat's Profile\nEmail: BoonHuat.Low@SingaporeTech.edu.sg\nPhone: 6592 6635\nRole: Career Coach\nFields: Computer Engineering\n\nBio: Boon Huat, a long-time fan of cai png, now strives for healthier choices but won’t refuse laksa or char kway teow. He loves exploring countries nearby, anime, and watching Korean and Thai dramas."
  },
  {
    "category": "Centre for Career Readiness (CCR)",
    "content": "Name: Mabelene Sim\nProfile: View Mabelene's Profile\nEmail: Mabelene.Sim@SingaporeTech.edu.sg\nPhone: 6592 2035\nRole: Career Coach\nFields: Electrical Power Engineering, Electrical Engineering & Information Technology, Electronics and Data Engineering\n\nBio: Mabelene holds three personal records: 10 days without electronics, 11 days without talking, and 42,000 steps in a day. Formerly a hockey and netball player, she enjoys travel, thrill-seeking adventures, and has braved Arctic polar nights."
  },
  {
    "category": "Centre for Career Readiness (CCR)",
    "content": "Name: Ong Gin Yong\nProfile: View Gin Yong's Profile\nEmail: GinYong.Ong@SingaporeTech.edu.sg\nPhone: 6592 1459\nRole: Career Coach\nFields: Engineering Systems, Naval Architecture and Offshore Engineering\n\nBio: An entrepreneur at heart, Gin Yong believes in learning outside comfort zones and taking risks. However, he's not a fan of K-dramas, preferring movies for entertainment."
  },
  {
    "category": "Centre for Career Readiness (CCR)",
    "content": "Name: Edward Chen\nProfile: View Edward's Profile\nEmail: Edward.Chen@SingaporeTech.edu.sg\nPhone: 6592 1631\nRole: Career Coach\nFields: Pharmaceutical Engineering, Food Technology\n\nBio: Edward is an avid cyclist and Lego collector, who also picked up cooking during the pandemic. For relaxation, he listens to music and takes long bus rides."
  },
  {
    "category": "Centre for Career Readiness (CCR)",
    "content": "Name: Karen Tan\nProfile: View Karen's Profile\nEmail: LeeKheng.Tan@SingaporeTech.edu.sg\nPhone: 6592 4609\nRole: Career Coach\nFields: Chemical Engineering\n\nBio: Inspired by Singapore’s food security issues, Karen has created a self-sustaining garden with herbs, vegetables, and fruits, using a zero-waste approach. She also enjoys cooking, Zumba, and yoga."
  },
  {
    "category": "Centre for Career Readiness (CCR)",
    "content": "Name: Bernise Goh\nProfile: View Bernise's Profile\nEmail: Bernise.Goh@SingaporeTech.edu.sg\nPhone: 6592 8528\nRole: Career Coach\nFields: Applied Artificial Intelligence, Applied Computing (Fintech)\n\nBio: Bernise loves food and has even traveled across the causeway for her favorite Bak Kut Teh. She’s equally passionate about cleaning and takes leave to tidy up her house. In her free time, she engages in outdoor activities and spends time at the playground with her daughter."
  },
  {
    "category": "Centre for Career Readiness (CCR)",
    "content": "Name: Matthew Lye\nProfile: View Matthew's Profile\nEmail: Matthew.Lye@SingaporeTech.edu.sg\nPhone: 6592 0107\nRole: Career Coach\nFields: Information and Communications Technology (Information Security), Information and Communications Technology (Software Engineering)\n\nBio: Matthew values simplicity and finds joy in learning new skills. He finds fulfillment in helping others, which makes career coaching a perfect role for him. When it’s time to recharge, he enjoys vacations, immersing in local culture, and shopping and watching movies with his family. As a true-blue Cantonese, he’s always on the lookout for good wanton noodles and chee cheong fun."
  },
  {
    "category": "Centre for Career Readiness (CCR)",
    "content": "Name: Nicholas Khoo\nProfile: View Nicholas's Profile\nEmail: Nicholas.Khoo@singaporetech.edu.sg\nPhone: 6592 1204\nRole: Career Coach\nFields: Computer Science in Interactive Media and Game Development, Computer Science in Real-Time Interactive Simulation, Digital Art and Animation, User Experience and Game Design\n\nBio: Nicholas believes in working and playing hard. He's all about building connections, whether through foosball or football. A passionate Arsenal fan, he’s also a lover of nature, exploring the outdoors and wildlife in Singapore. He’s always ready for a good conversation, including career talks."
  },
  {
    "category": "Centre for Career Readiness (CCR)",
    "content": "Name: Jeffrey Thng\nProfile: View Jeffrey's Profile\nEmail: Jeffrey.Thng@SingaporeTech.edu.sg\nPhone: 6592 8948\n\nBio: Jeffrey values the journey over the outcome, appreciating the process of creation in food, furniture, and artwork. He enjoys entertaining through cartoon drawing and balloon sculpting. A career educator, Jeffrey also aspires to speak to an audience of 10,000 someday."
  },
  {
    "category": "Centre for Career Readiness (CCR)",
    "content": "Name: Kwok Boon Yong\nProfile: View Boon Yong's Profile\nEmail: BoonYong.Kwok@SingaporeTech.edu.sg\nPhone: 6592 1622\n\nBio: Boon Yong loves playing the ukulele, chess, and football. He is also a fan of sketching and painting. Through his career in education, he hopes to inspire future generations and advocate for nature conservation."
  },
  {
    "category": "Centre for Career Readiness (CCR)",
    "content": "Name: Randford Joseph Tay\nProfile: View Randford's Profile\nEmail: Randford.Tay@SingaporeTech.edu.sg\nPhone: 6592 8529\n\nBio: Randford, a self-proclaimed otaku, enjoys anime, video games, and exploring RPGs. He believes in the transformative power of books and people. Always learning, he picks up a new interest every month, from deejay music mixing to quantum physics."
  },
  {
    "category": "Centre for Career Readiness (CCR)",
    "content": "Name: Zhang Weili\nProfile: View Weili's Profile\nEmail: Weili.Zhang@SingaporeTech.edu.sg\nPhone: 6592 1148\n\nBio: Weili has a deep love for history and avocados. She once taught history, sharing her passion with students. An avocado enthusiast, she enjoys them in salads, smoothies, and sandwiches. Long hikes and old-school cafes are her go-to for relaxation."
  },
  {
    "category": "Centre for Career Readiness (CCR)",
    "content": "If you are unable to find your Carrer Advisor for your course, do visit this [link](https://www.singaporetech.edu.sg/life-at-sit/get-career-ready/career-coaching)"
  }
]