[
    {
        "category": "Course Information",
        "content": "Course: BSc (Hons) in Diagnostic Radiography, Total Credits: 240 Credits, Course Duration: 4 years. Subsidised fee per credit for Singapore Citizens of $155.00, Non-subsidised fee per credit (incl GST) of $634.38"
    },
    {
        "category": "Course Information",
        "content": "Course: BSc (Hons) in Dietetics and Nutrition, Total Credits: 240 Credits, Course Duration: 4 years. Subsidised fee per credit for Singapore Citizens of $155.00, Non-subsidised fee per credit (incl GST) of $634.38"
    },
    {
        "category": "Course Information",
        "content": "Course: BSc (Hons) in Nursing, Total Credits: 120 Credits, Course Duration: 1 year 8 months. Subsidised fee per credit for Singapore Citizens of $173.00, Non-subsidised fee per credit (incl GST) of $661.63"
    },
    {
        "category": "Course Information",
        "content": "Course: BSc (Hons) in Occupational Therapy, Total Credits: 240 Credits, Course Duration: 4 years. Subsidised fee per credit for Singapore Citizens of $155.00, Non-subsidised fee per credit (incl GST) of $634.38"
    },
    {
        "category": "Course Information",
        "content": "Course: BSc (Hons) in Physiotherapy, Total Credits: 240 Credits, Course Duration: 4 years. Subsidised fee per credit for Singapore Citizens of $155.00, Non-subsidised fee per credit (incl GST) of $634.38"
    },
    {
        "category": "Course Information",
        "content": "Course: BSc (Hons) in Radiation Therapy, Total Credits: 240 Credits, Course Duration: 4 years. Subsidised fee per credit for Singapore Citizens of $155.00, Non-subsidised fee per credit (incl GST) of $634.38"
    },
    {
        "category": "Course Information",
        "content": "Course: BSc (Hons) in Speech and Language Therapy, Total Credits: 240 Credits, Course Duration: 4 years. Subsidised fee per credit for Singapore Citizens of $155.00, Non-subsidised fee per credit (incl GST) of $634.38"
    },
    {
        "category": "Course Information",
        "content": "Course: BFA (Hons) in Digital Art and Animation, Total Credits: 240 Credits, Course Duration: 4 years. Subsidised fee per credit for Singapore Citizens of $180.50, Non-subsidised fee per credit (incl GST) of $688.88"
    },
    {
        "category": "Course Information",
        "content": "Course: BFA (Hons) in Game Design, Total Credits: 240 Credits, Course Duration: 4 years. Subsidised fee per credit for Singapore Citizens of $180.50, Non-subsidised fee per credit (incl GST) of $688.88"
    },
    {
        "category": "Course Information",
        "content": "Course: BSc (Hons) in Hospitality Business, Total Credits: 180 Credits, Course Duration: 2 years 8 months. Subsidised fee per credit for Singapore Citizens of $155.00, Non-subsidised fee per credit (incl GST) of $634.38"
    },
    {
        "category": "Course Information",
        "content": "Course: BEng (Hons) in Chemical Engineering, Total Credits: 240 Credits, Course Duration: 4 years. Subsidised fee per credit for Singapore Citizens of $173.00, Non-subsidised fee per credit (incl GST) of $661.63"
    },
    {
        "category": "Course Information",
        "content": "Course: BFoodSc (Hons) in Food Business Management (Baking and Pastry Arts), Total Credits: 132 Credits, Course Duration: 2 years. Subsidised fee per credit for Singapore Citizens of $224.00, Non-subsidised fee per credit (incl GST) of $810.96"
    },
    {
        "category": "Course Information",
        "content": "Course: BFoodSc (Hons) in Food Business Management (Culinary Arts), Total Credits: 132 Credits, Course Duration: 2 years. Subsidised fee per credit for Singapore Citizens of $224.00, Non-subsidised fee per credit (incl GST) of $810.96"
    },
    {
        "category": "Course Information",
        "content": "Course: BFoodSc (Hons) in Food Technology,Total Credits: 240 Credits, Course Duration: 4 years. Subsidised fee per credit for Singapore Citizens of $127.50, Non-subsidised fee per credit (incl GST) of $555.90"
    },
    {
        "category": "Course Information",
        "content": "Course: BEng (Hons) in Computer Engineering, Total Credits: 180 Credits, Course Duration: 2 years 8 month. Subsidised fee per credit for Singapore Citizens of $127.50, Non-subsidised fee per credit (incl GST) of $555.90"
    },
    {
        "category": "Course Information",
        "content": "Course: BEng (Hons) in Information and Communications Technology (Information Security), Total Credits: 240 Credits, Course Duration: 4 years. Subsidised fee per credit for Singapore Citizens of $127.50, Non-subsidised fee per credit (incl GST) of $555.90"
    },
    {
        "category": "Course Information",
        "content": "Course: BEng (Hons) in Information and Communications Technology (Software Engineering), Total Credits: 240 Credits, Course Duration: 4 years. Subsidised fee per credit for Singapore Citizens of $127.50, Non-subsidised fee per credit (incl GST) of $555.90"
    },
    {
        "category": "Course Information",
        "content": "Course: BSc (Hons) in Computing Science, Total Credits: 180 Credits, Course Duration: 3 years. Subsidised fee per credit for Singapore Citizens of $173.00, Non-subsidised fee per credit (incl GST) of $661.63"
    },
    {
        "category": "Course Information",
        "content": "Course: BSc (Hons) in Digital Communications and Integrated Media, Total Credits: 180 Credits, Course Duration: 2 years 8 months. Subsidised fee per credit for Singapore Citizens of $155.00, Non-subsidised fee per credit (incl GST) of $634.38"
    },
    {
        "category": "Course Information",
        "content": "Course: BEng (Hons) in Aerospace Engineering, Total Credits: 180 Credits, Course Duration: 3 years. Subsidised fee per credit for Singapore Citizens of $173.00, Non-subsidised fee per credit (incl GST) of $661.63"
    },
    {
        "category": "Course Information",
        "content": "Course: BEng (Hons) in Aircraft Systems Engineering, Total Credits: 180 Credits, Course Duration: 3 years. Subsidised fee per credit for Singapore Citizens of $127.50, Non-subsidised fee per credit (incl GST) of $555.90"
    },
    {
        "category": "Course Information",
        "content": "Course: BEng (Hons) in Civil Engineering, Total Credits: 180 Credits, Course Duration: 3 years. Subsidised fee per credit for Singapore Citizens of $173.00, Non-subsidised fee per credit (incl GST) of $661.63"
    },
    {
        "category": "Course Information",
        "content": "Course: BEng (Hons) in Electrical Power Engineering, Total Credits: 180 Credits, Course Duration: 3 years. Subsidised fee per credit for Singapore Citizens of $173.00, Non-subsidised fee per credit (incl GST) of $661.63"
    },
    {
        "category": "Course Information",
        "content": "Course: BEng (Hons) in Marine Engineering, Total Credits: 180 Credits, Course Duration: 3 years. Subsidised fee per credit for Singapore Citizens of $173.00, Non-subsidised fee per credit (incl GST) of $661.63"
    },
    {
        "category": "Course Information",
        "content": "Course: BEng (Hons) in Mechanical Engineering, Total Credits: 180 Credits, Course Duration: 3 years. Subsidised fee per credit for Singapore Citizens of $173.00, Non-subsidised fee per credit (incl GST) of $661.63"
    },
    {
        "category": "Course Information",
        "content": "Course: BEng (Hons) in Naval Architecture, Total Credits: 180 Credits, Course Duration: 3 years. Subsidised fee per credit for Singapore Citizens of $173.00, Non-subsidised fee per credit (incl GST) of $661.63"
    },
    {
        "category": "Course Information",
        "content": "Course: BEng (Hons) in Offshore Engineering, Total Credits: 180 Credits, Course Duration: 3 years. Subsidised fee per credit for Singapore Citizens of $173.00, Non-subsidised fee per credit (incl GST) of $661.63"
    },
    {
        "category": "Course Information",
        "content": "Course: BEng (Hons) in Pharmaceutical Engineering, Total Credits: 240 Credits, Course Duration: 4 years. Subsidised fee per credit for Singapore Citizens of $127.50, Non-subsidised fee per credit (incl GST) of $555.90"
    },
    {
        "category": "Course Information",
        "content": "Course: BEng (Hons) in Robotics Systems, Total Credits: 240 Credits, Course Duration: 4 years. Subsidised fee per credit for Singapore Citizens of $127.50, Non-subsidised fee per credit (incl GST) of $555.90"
    },
    {
        "category": "Course Information",
        "content": "Course: BEng (Hons) in Sustainable Infrastructure Engineering (Building Services), Total Credits: 180 Credits, Course Duration: 3 years. Subsidised fee per credit for Singapore Citizens of $127.50, Non-subsidised fee per credit (incl GST) of $555.90"
    },
    {
        "category": "Course Information",
        "content": "Course: BEng (Hons) in Sustainable Infrastructure Engineering (Land), Total Credits: 180 Credits, Course Duration: 3 years. Subsidised fee per credit for Singapore Citizens of $127.50, Non-subsidised fee per credit (incl GST) of $555.90"
    },
    {
        "category": "Course Information",
        "content": "Course: BEng (Hons) in Electronics and Data Engineering, Total Credits: 240 Credits, Course Duration: 4 years. Subsidised fee per credit for Singapore Citizens of $173.00, Non-subsidised fee per credit (incl GST) of $661.63"
    },
    {
        "category": "Course Information",
        "content": "Course: BSc (Hons) in Accountancy, Total Credits: 180 Credits, Course Duration: 3 years. Subsidised fee per credit for Singapore Citizens of $155.00, Non-subsidised fee per credit (incl GST) of $634.38"
    },
    {
        "category": "Course Information",
        "content": "Course: BSc (Hons) in Aviation Management, Total Credits: 180 Credits, Course Duration: 3 years. Subsidised fee per credit for Singapore Citizens of $155.00, Non-subsidised fee per credit (incl GST) of $634.38"
    }
]