[
    {
        "category": "Graduate Employment Survey Information",
        "content": "The employed rates refer to the number of graduates employed as a proportion of graduates in the labour force (i.e., those who were working, or not working but actively looking and available for work) as at 1 Mar 2024 (i.e., approximately six months after completing their final examinations). Employment refers to graduates working on a full-time permanent, part-time, temporary, or freelance basis. Full-time permanent employment refers to employment of at least 35 hours a week and where the employment is not temporary. It includes those on contracts of one year or more. Basic monthly salary pertains only to full-time permanently employed graduates. It comprises basic pay before deduction of the employee’s CPF contributions and personal income tax. Employer’s CPF contributions, bonuses, stock options, overtime payments, commissions, fixed allowances, other regular cash payments, lump sum payments, and payments-in-kind are excluded. Gross monthly salary pertains only to full-time permanently employed graduates. It comprises basic salary, overtime payments, commissions, fixed allowances, and other regular cash payments, before deductions of the employee’s CPF contributions and personal income tax. Employer’s CPF contributions, bonuses, stock options, lump sum payments, and payments-in-kind are excluded."
    },    
    {
        "category": "Graduate Employment Survey Information",
        "content": "Data is based on a sample size of fewer than 30 respondents. Data excludes graduates who are undergoing a 28-month training programme to practise as Licensed Aircraft Engineers with SIA Engineering Company (SIAEC)."
    },
    {
        "category": "Graduate Employment Survey Information",
        "content": "Question: What is the difference between mean and median salaries? Answer: The mean monthly salary is an average of the salaries of the full-time permanently employed graduates. The median monthly salary is the salary of the 'central' (i.e., 50th percentile) graduate amongst the full-time permanently employed graduates when they are arranged by salary. It is useful to refer to these two indicators together."
    },
    {
        "category": "Graduate Employment Survey Information",
        "content": "The data published in this document is provided on an 'as is' basis without any warranties of any kind. To the fullest extent permitted by law, MOE does not warrant and hereby disclaims any warranty as to the accuracy, correctness, completeness, reliability, or fitness for any particular purpose of such data. The reader of this document assumes all responsibility and risk for the use of such data."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Business Administration in Food Business Management, Culinary Institute of America employed rate is 90.5% and 66.7% for Full-Time Permanent Employment. The basic monthly salary mean is $3,078 and the median is $2,900."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Arts in Game Design, DigiPen Institute of Technology employed rate is 86.4% and 81.8% for Full-Time Permanent Employment. The basic monthly salary mean is $3,718 and the median is $3,600."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Fine Arts in Digital Art and Animation, DigiPen Institute of Technology employed rate is 84.0% and 44.0% for Full-Time Permanent Employment. The basic monthly salary mean is $3,330 and the median is $3,200."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Science in Computer Science and Game Design, DigiPen Institute of Technology employed rate is 88.2% and 86.3% for Full-Time Permanent Employment. The basic monthly salary mean is $4,890 and the median is $4,900."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Science in Computer Science in Real-Time Interactive Simulation, DigiPen Institute of Technology employed rate is 79.5% and 79.5% for Full-Time Permanent Employment. The basic monthly salary mean is $5,204 and the median is $5,000."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Accountancy with Honours, Singapore Institute of Technology employed rate is 92.7% and 87.8% for Full-Time Permanent Employment. The basic monthly salary mean is $3,745 and the median is $3,600."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Engineering with Honours in Aircraft Systems Engineering, Singapore Institute of Technology employed rate is 85.2% and 66.7% for Full-Time Permanent Employment. The basic monthly salary mean is $4,109 and the median is $4,400."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Engineering with Honours in Information & Communications Technology (Information Security), Singapore Institute of Technology employed rate is 94.4% and 93.0% for Full-Time Permanent Employment. The basic monthly salary mean is $5,157 and the median is $5,000."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Engineering with Honours in Information & Communications Technology (Software Engineering), Singapore Institute of Technology employed rate is 88.7% and 82.3% for Full-Time Permanent Employment. The basic monthly salary mean is $5,000 and the median is $4,900."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Engineering with Honours in Pharmaceutical Engineering, Singapore Institute of Technology employed rate is 91.2% and 87.7% for Full-Time Permanent Employment. The basic monthly salary mean is $3,756 and the median is $3,700."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Engineering with Honours in Sustainable Infrastructure Engineering (Building Services), Singapore Institute of Technology employed rate is 92.5% and 90.0% for Full-Time Permanent Employment. The basic monthly salary mean is $3,727 and the median is $3,700."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Engineering with Honours in Sustainable Infrastructure Engineering (Land), Singapore Institute of Technology employed rate is 88.5% and 80.8% for Full-Time Permanent Employment. The basic monthly salary mean is $4,007 and the median is $3,800."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Engineering with Honours in Telematics (Intelligent Transportation Systems Engineering), Singapore Institute of Technology employed rate is 85.7% and 81.0% for Full-Time Permanent Employment. The basic monthly salary mean is $4,437 and the median is $4,500."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Hospitality Business with Honours, Singapore Institute of Technology employed rate is 93.5% and 77.8% for Full-Time Permanent Employment. The basic monthly salary mean is $3,405 and the median is $3,400."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Science with Honours in Air Transport Management, Singapore Institute of Technology employed rate is 85.7% and 83.7% for Full-Time Permanent Employment. The basic monthly salary mean is $3,675 and the median is $3,700."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Science with Honours in Diagnostic Radiography, Singapore Institute of Technology employed rate is 100.0% and 100.0% for Full-Time Permanent Employment. The basic monthly salary mean is $3,884 and the median is $3,850."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Science with Honours in Dietetics and Nutrition, Singapore Institute of Technology employed rate is 100.0% and 100.0% for Full-Time Permanent Employment. The basic monthly salary mean is $3,629 and the median is $3,550."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Science with Honours in Digital Communications and Integrated Media, Singapore Institute of Technology employed rate is 93.2% and 61.4% for Full-Time Permanent Employment. The basic monthly salary mean is $3,824 and the median is $3,750."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Science with Honours in Occupational Therapy, Singapore Institute of Technology employed rate is 100.0% and 98.6% for Full-Time Permanent Employment. The basic monthly salary mean is $3,786 and the median is $3,800."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Science with Honours in Radiation Therapy, Singapore Institute of Technology employed rate is 90.9% and 90.9% for Full-Time Permanent Employment. The basic monthly salary mean is $4,030 and the median is $3,850."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Engineering with Honours in Systems Engineering (ElectroMechanical Systems), SIT-DigiPen Institute of Technology employed rate is 89.2% and 81.1% for Full-Time Permanent Employment. The basic monthly salary mean is $4,743 and the median is $4,500."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Food Technology with Honours, SIT-Massey University employed rate is 87.5% and 72.9% for Full-Time Permanent Employment. The basic monthly salary mean is $3,514 and the median is $3,500."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Engineering with Honours in Chemical Engineering, SIT-Newcastle University employed rate is 75.9% and 74.1% for Full-Time Permanent Employment. The basic monthly salary mean is $3,930 and the median is $3,925."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Engineering with Honours in Electrical Power Engineering, SIT-Newcastle University employed rate is 81.2% and 76.8% for Full-Time Permanent Employment. The basic monthly salary mean is $4,131 and the median is $3,950."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Engineering with Honours in Marine Engineering, SIT-Newcastle University employed rate is 90.6% and 90.6% for Full-Time Permanent Employment. The basic monthly salary mean is $4,475 and the median is $4,200."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Engineering with Honours in Mechanical Design and Manufacturing Engineering, SIT-Newcastle University employed rate is 79.2% and 69.4% for Full-Time Permanent Employment. The basic monthly salary mean is $4,151 and the median is $4,200."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Engineering with Honours in Naval Architecture, SIT-Newcastle University employed rate is 94.4% and 77.8% for Full-Time Permanent Employment. The basic monthly salary mean is $4,332 and the median is $4,450."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Engineering with Honours in Offshore Engineering, SIT-Newcastle University employed rate is 86.4% and 81.8% for Full-Time Permanent Employment. The basic monthly salary mean is $4,400 and the median is $4,200."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Science with Honours in Physiotherapy, SIT-Trinity College Dublin employed rate is 98.5% and 95.4% for Full-Time Permanent Employment. The basic monthly salary mean is $3,823 and the median is $3,800."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Engineering with Honours in Aerospace Engineering, SIT-University of Glasgow employed rate is 77.5% and 67.5% for Full-Time Permanent Employment. The basic monthly salary mean is $4,128 and the median is $4,000."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Engineering with Honours in Civil Engineering, SIT-University of Glasgow employed rate is 89.4% and 84.7% for Full-Time Permanent Employment. The basic monthly salary mean is $4,010 and the median is $4,000."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Engineering with Honours in Mechanical Engineering, SIT-University of Glasgow employed rate is 72.9% and 68.8% for Full-Time Permanent Employment. The basic monthly salary mean is $4,369 and the median is $4,400."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Science with Honours in Computing Science, SIT-University of Glasgow employed rate is 74.4% and 67.1% for Full-Time Permanent Employment. The basic monthly salary mean is $4,830 and the median is $4,800."
    },
    {
        "category": "Graduate Employment Survey of 2023 Graduates",
        "content": "Bachelor of Science with Honours in Nursing, SIT-University of Glasgow employed rate is 97.1% and 88.6% for Full-Time Permanent Employment. The basic monthly salary mean is $3,733 and the median is $3,765."
    }
]