[
  {
    "category": "General FAQ",
    "content": "Question: What is a SITizen? Answer: The day you join SIT as a learner, you become a SITizen. And we have a saying: Once a SITizen, always a SITizen. We believe that learning is for life. Even after you graduate, you will be a SITizen for life."
  },
  {
    "category": "General FAQ",
    "content": "Question: What is unique about SIT? Answer: As Singapore's first university of applied learning, we develop individuals and innovate with industry to impact the economy and society in meaningful ways. And we do this through our unique applied learning pedagogy. Read more about our latest successes and happenings on our [newsroom](https://www.singaporetech.edu.sg/news) and learn more about the SIT experience on the [Why SIT page](https://www.singaporetech.edu.sg/why-sit)."
  },
  {
    "category": "General FAQ",
    "content": "Question: What is SIT's Mission? Answer: To maximise the potential of our learners and to innovate with industry, through an integrated applied learning and research approach, so as to contribute to the economy and society."
  },
  {
    "category": "General FAQ",
    "content": "Question: What is SIT's Vision? Answer: SIT is envisioned to be a key university in Singapore that lives and breathes industry, with its students and alumni (collectively called SITizens) being thinking tinkerers, lifelong learners and catalysts for transformation, who care for the community and stay connected to SIT and their fellow SITizens. SIT aims to achieve the following: Applied Learning, Strong Alumni Network, Symbiotic Partnership with Industry and Community, Applied Research & Innovation, Strategic University Partners, People-oriented Culture and A Living Lab."
  },
  {
    "category": "General FAQ",
    "content": "Question: What does Applied Learning mean in SIT's Vision? Answer: SIT will continue to effectively deploy an innovative applied learning pedagogy built on the platforms provided by the Integrated Work-Study Programme (IWSP) as well as capstone and collaborative projects sourced from industry. These help students to integrate learning and acquire knowledge, skills, and abilities in real work situations, which will not only ensure that SIT students stand above other students but also inculcate the desired attributes appreciated by employers in all industries. The industry knows that IWSP is more than a traditional internship, and to strengthen this aspect, SIT provides institutional support, including the technical skills of SIT’s professional officers, to the students at work. Regular interactions of SIT faculty and professional officers with industry through their supervision of IWSP students and capstone projects inform the curriculum in SIT and ensure its relevance to the evolving needs of industry and Singapore’s economy."
  },
  {
    "category": "General FAQ",
    "content": "Question: What does Strong Alumni Network mean in SIT's Vision? Answer: SIT will have our alumni out in the industry of their choice. Most of them would have some global or regional exposure and are an increasingly important link between industry and SIT. SIT has built strong relationships with its alumni and encourages them to provide opportunities for their juniors and to network among themselves."
  },
  {
    "category": "General FAQ",
    "content": "Question: What does Symbiotic Partnership with Industry and Community mean in SIT's Vision? Answer: SIT will continue deepening its thriving and symbiotic partnership with industry and community in formulating and delivering on its education and research programmes. Industry and community involvement is evident and sustained in all educational, applied research and innovation activities at SIT. These activities are not just confined to the SIT campus but also take place on the premises of industry and community partners."
  },
  {
    "category": "General FAQ",
    "content": "Question: What does Applied Research & Innovation mean in SIT's Vision? Answer: SIT will keep growing as an applied research and innovation hub that collaborates with the industry deeply and widely, supporting the transformation of Singapore’s industry in productivity, innovation, and manpower development. SIT will continue building its network of applied research centres and programmes and developing its Punggol campus into an open living laboratory to support the industry in its transformation journey."
  },
  {
    "category": "General FAQ",
    "content": "Question: What does Strategic University Partners mean in SIT's Vision? Answer: SIT will continue to leverage its network of overseas university partners to respond quickly and nimbly to new or changing industry needs, especially in areas where expertise is not readily available in Singapore. These partnerships now extend beyond undergraduate programmes to continuing education and applied research. The partners co-locate with SIT in our Punggol Campus and have become an integral part of the SIT ecosystem to provide a distinctive global and regional educational experience to help prepare SIT students for a globally competitive economy."
  },
  {
    "category": "General FAQ",
    "content": "Question: What does People-oriented Culture mean in SIT's Vision? Answer: SIT will keep growing as a robust, enterprising, and dynamic people-oriented organisation that is underpinned by a strong culture that sees its people being united in purpose, mutually respectful of one another, continually seeking new innovative ways to improve its work processes, dynamic in a purposeful way and always striving for excellence. It will thrive as an effective and efficient learning organisation, leveraging data analytics and technology in carrying out its operations."
  },
  {
    "category": "General FAQ",
    "content": "Question: What does A Living Lab mean in SIT's Vision? Answer: SIT’s new campus in Punggol is situated within a garden/park setting with a water-front facing. It is the anchor entity drawing in the surrounding community to transform Punggol into a true university town. Its overseas university and some industry partners are co-located in a purpose-built campus working with SIT in a stimulating learning environment that is everything about applied learning and research. The University is a living laboratory, pulsating with industry in and around its buildings. There are numerous makerspaces, project hubs and self-directed group learning spaces to support the unique pedagogy of SIT."
  }
]
